### 1.Create a dataframe with 4 columns 4 rows

In [172]:
import pandas as pd
a=([[1,2,3,4],[3,4,5,6],[5,6,7,8],[7,8,9,10]])
a1=pd.DataFrame(a,index=["e","f","g","h"],columns=["a","b","c","d"])
print(a1)

   a  b  c   d
e  1  2  3   4
f  3  4  5   6
g  5  6  7   8
h  7  8  9  10

### 2.print all Columns form your data frame

In [173]:
a1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

### 3.print all rows from your data frame

In [174]:
a1.loc[:]

   a  b  c   d
e  1  2  3   4
f  3  4  5   6
g  5  6  7   8
h  7  8  9  10

### 4.print Second column in your data frame

In [175]:
a1.loc[:,["b"]]

   b
e  2
f  4
g  6
h  8

### 5.print last 2 columns from your data Frame

In [176]:
a1.loc[:,"c":]

   c   d
e  3   4
f  5   6
g  7   8
h  9  10

### 6.print fourth row from your data Frame

In [177]:
a1.loc[["g"]]

   a  b  c  d
g  5  6  7  8

### 7.print first 2 Rows from your data Frame

In [178]:
a1.loc[:"f"]

   a  b  c  d
e  1  2  3  4
f  3  4  5  6

### 8.print all rows and first 2 columns from your data Frame

In [179]:
a1.loc[:,:"b"]

   a  b
e  1  2
f  3  4
g  5  6
h  7  8

### 9.Delete any row from your data Frame

In [180]:
a1.drop("h")

   a  b  c  d
e  1  2  3  4
f  3  4  5  6
g  5  6  7  8

### 10.Delete any column from your data Frame

In [181]:
a1.pop("d")

e     4
f     6
g     8
h    10
Name: d, dtype: int64

### 11.Add a column to a Data Frame

In [182]:
new=[11,12,13,14]
a1['z']=new
print(pd.DataFrame(a1))

   a  b  c   z
e  1  2  3  11
f  3  4  5  12
g  5  6  7  13
h  7  8  9  14

### 12.Add a Row to Data Frame

In [183]:
new={'a':0,'b':0,'c':0,'z':0}
a=pd.DataFrame(new,index=[i])
a1=pd.concat([a,a1])
a1

   a  b  c   z
9  0  0  0   0
e  1  2  3  11
f  3  4  5  12
g  5  6  7  13
h  7  8  9  14

### 13.Iterate all Columns  in your Data Frame and print result

In [184]:
for i in a1:
    print(i)

a
b
c
z

### 14.Iterate the 3rd column values  of your Data frame and print result.

In [185]:
p=a1.pop("c")
for i in p:
    print(i)

0
3
5
7
9

### 15.Iterate all Rows  in your Data Frame and print result.

In [186]:
for i in a1.iterrows():
    print(i)

(9, a    0
b    0
z    0
Name: 9, dtype: int64)
('e', a     1
b     2
z    11
Name: e, dtype: int64)
('f', a     3
b     4
z    12
Name: f, dtype: int64)
('g', a     5
b     6
z    13
Name: g, dtype: int64)
('h', a     7
b     8
z    14
Name: h, dtype: int64)

### 16.Read income.csv  file and print as Data Frame

In [187]:
a="income.csv"
d=pd.read_csv(a)
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

### 17.Get 2006 column  info from your data Frame by using drop

In [189]:
d.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528